<?php

use Illuminate\Support\Facades\DB;
use Illuminate\Database\Migrations\Migration;
use Illuminate\Database\Schema\Blueprint;
use Illuminate\Support\Facades\Schema;

class SeedDefaultAnimalClasses extends Migration
{
    private $classes = ["Акантоды","Анаспиды","Бластоидеи","Граптолиты","Динокариды","Конодонты","Меростомоидеи","Непарноноздрёвые","Парноноздрёвые","Плакодермы","Синапсиды","Телодонты","Тентакулиты","Трилобиты","Шаровики (иглокожие)","Эдриоастероидеи","Helcionelloida","Marrellomorpha","Megacheira","Rostroconchia","Thylacocephala","Аплакофоры","Аппендикулярии","Асцидии","Бескишечные турбеллярии","Бороздчатобрюхие","Брюхоногие","Вооружённые немертины","Высшие раки","Гидроидные","Головоногие","Голоротые","Голотурии","Губоногие","Двупарноногие","Двустворчатые","Жаброногие","Завропсиды","Известковые губки","Киноринхи","Кишечнодышащие","Коралловые полипы","Кубомедузы","Ланцетники (класс)","Ленточные черви","Лингулята","Лопастепёрые рыбы","Лопатоногие","Лорициферы","Лучепёрые рыбы","Максиллоподы","Меростомовые","Мизостомиды","Миксины","Миноги","Млекопитающие","Многощетинковые черви","Моногенеи","Моноплакофоры","Морские ежи","Морские звёзды","Морские лилии","Морские пауки","Насекомые","Обыкновенные губки","Офиуры","Панцирные моллюски","Паукообразные","Пауроподы","Перистожаберные","Покрыторотые","Пресмыкающиеся","Приапулиды","Птицы","Ракушковые","Ремипедии","Ресничные черви","Сальпы","Симфилы","Скрыточелюстные","Стрелкообразные","Сцифоидные","Трематоды","Узкоротые","Хрящевые рыбы","Цефалокариды","Шестилучевые губки","Щупальцевые","Ямкохвостые","Arhynchonemertes axi","Chromadorea","Craniata (плеченогие)","Enoplea","Eucycliophora","Homoscleromorpha","Myxozoa","Nemertodermatida","Palaeacanthocephala","Polypodiozoa","Rhynchonellata","Staurozoa"];

    /**
     * Run the migrations.
     *
     * @return void
     */
    public function up()
    {
        foreach ($this->classes as $class)
        {
            DB::table('animal_classes')->insert([
                'name' => $class
            ]);
        }
    }

    /**
     * Reverse the migrations.
     *
     * @return void
     */
    public function down()
    {
        //
    }
}
